БухЭксп/InformationRegisters/CW_ДоступноИнициацияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоступноИнициацияСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доступно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДоступноИнициацияСогласования/Ext/ManagerModule.bsl
Процедура ЗаписатьИнициациюСогласования(ГруппаПользователей, мОбъекты) Экспорт
	
	Набор = РегистрыСведений.CW_ДоступноИнициацияСогласования.СоздатьНаборЗаписей();
	Набор.Отбор.ГруппаПользователей.Установить(ГруппаПользователей);
	Набор.Прочитать();
	Набор.Очистить();
	
	Для Каждого ЭлементМассива из мОбъекты Цикл
		СтрокаНабора = Набор.Добавить();
		СтрокаНабора.ГруппаПользователей 			= ГруппаПользователей;
		СтрокаНабора.ИдентификаторОбъектаМетаданных = ЭлементМассива;
		СтрокаНабора.Доступно 						= Истина;
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

Функция ПолучитьДоступныеОбъектыСогласования(ГруппаПользователей) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоступноИнициацияСогласования.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных
	               |ИЗ
	               |	РегистрСведений.CW_ДоступноИнициацияСогласования КАК CW_ДоступноИнициацияСогласования
	               |ГДЕ
	               |	CW_ДоступноИнициацияСогласования.ГруппаПользователей = &ГруппаПользователей
	               |	И CW_ДоступноИнициацияСогласования.Доступно = Истина";     
	
	Запрос.УстановитьПараметр("ГруппаПользователей", ГруппаПользователей);
	
	Массив = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.ИдентификаторОбъектаМетаданных);
	КонецЦикла; 
	
	Возврат Массив;
	
КонецФункции
